---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BarDiameterTooLarge
source: html/eda9ba2c-ca4f-bda7-8c76-b7c12e2bed8c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.BarDiameterTooLarge Property

Rebar Bar Diameter is too large.

## Syntax (C#)
```csharp
public static FailureDefinitionId BarDiameterTooLarge { get; }
```